benchmarks/cospec_benchmark_results_20250528_174438_huggyllama/llama-13b_double7/vicuna-68m_tp2_dtp1/baseline_1_0.6_6_sharegpt_output.txt
INFO 05-28 20:44:08 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='huggyllama/llama-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=6.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.6, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Split dataset into 8277 test samples and 74494 training samples
Temperature:  0.6
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': True}
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 6.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1441      
Benchmark duration (s):                  300.44    
Total input tokens:                      364353    
Total generated tokens:                  295784    
Request throughput (req/s):              4.80      
Output token throughput (tok/s):         984.51    
Total Token throughput (tok/s):          2197.25   
---------------Time to First Token----------------
Mean TTFT (ms):                          5743.38   
Median TTFT (ms):                        456.53    
P99 TTFT (ms):                           27563.12  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          120.72    
Median TPOT (ms):                        128.91    
P99 TPOT (ms):                           217.84    
---------------Inter-token Latency----------------
Mean ITL (ms):                           185.24    
Median ITL (ms):                         171.35    
P99 ITL (ms):                            466.70    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          29197.38  
Median E2EL (ms):                        22697.22  
P99 E2EL (ms):                           118155.21 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 343.33    
Median Token Latency (ms):               144.85    
P99 Token Latency (ms):                  3245.05   
==================================================