benchmarks/cospec_benchmark_results_20250528_174438_huggyllama/llama-13b_double7/vicuna-68m_tp2_dtp1/baseline_7_0.6_10_sharegpt_output.txt
INFO 05-29 02:21:46 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='huggyllama/llama-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.6, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Split dataset into 8277 test samples and 74494 training samples
Temperature:  0.6
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': True}
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     944       
Benchmark duration (s):                  300.41    
Total input tokens:                      249785    
Total generated tokens:                  177295    
Request throughput (req/s):              3.14      
Output token throughput (tok/s):         590.18    
Total Token throughput (tok/s):          1421.66   
---------------Time to First Token----------------
Mean TTFT (ms):                          57023.19  
Median TTFT (ms):                        62359.25  
P99 TTFT (ms):                           171184.95 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          284.66    
Median TPOT (ms):                        273.91    
P99 TPOT (ms):                           704.90    
---------------Inter-token Latency----------------
Mean ITL (ms):                           604.31    
Median ITL (ms):                         577.04    
P99 ITL (ms):                            1118.06   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          100914.99 
Median E2EL (ms):                        103090.85 
P99 E2EL (ms):                           221447.32 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 2495.59   
Median Token Latency (ms):               512.96    
P99 Token Latency (ms):                  24623.79  
==================================================